class ConsentTextProvider {
  String GetConsent() {
    return "\n 1. ประเภทข้อมูลส่วนบุคคล " +
        "\n\n     ข้อมูลทั่วไป  หมายความว่า ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ " +
        "\n\n 2.วัตถุประสงค์การเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล \n" +
        "\n\n     เพื่อบริการให้ตรงตามต้องการของลูกค้า องค์กรจะใช้ข้อมูลส่วนบุคคลของลูกค้า เพื่อที่ประชาชนจะสามารถได้รับบริการที่ตรงตามวัตถุประสงค์ของลูกค้าตามสัญญาหรือตามที่ลูกค้าร้องขอ ในกรณีดังต่อไปนี้ " +
        "\n          - การพิจารณาอนุมัติและ/หรือให้บริการต่าง ๆ เช่น ขอบันทึกการขาย " +
        "\n          - การดำเนินการใด ๆ ที่เกี่ยวข้องกับการให้ผลิตภัณฑ์และ/หรือบริการต่าง ๆ เช่น การประมวลผล การติดต่อ การแจ้ง การมอบงานให้แก่บุคคลอื่นที่เป็นผู้ให้บริการภายนอก การโอนสิทธิและ/หรือหน้าที่ " +
        "\n     * หากลูกค้าปฏิเสธไม่ให้ข้อมูลแก่บริษัท อาจทำให้บริษัทไม่สามารถให้บริการแก่ลูกค้าได้ " +
        "\n\n     เพื่อปฏิบัติหน้าที่ตามกฎหมาย ในการปฏิบัติตามกฎหมายที่เกี่ยวข้อง เช่น กฎหมายหลักทรัพย์และตลาดหลักทรัพย์ กฎหมายภาษีอากร กฎหมายป้องกันและปราบปรามการฟอกเงิน กฎหมายคอมพิวเตอร์ และกฎหมายล้มละลาย บริษัทมีการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคล เช่น ข้อมูลของกรรมการ ผู้มีอำนาจกระทำการแทน ตัวแทนของลูกค้านิติบุคคล และบุคคลที่ศาลมีคำสั่งพิทักษ์ทรัพย์ เป็นต้น นอกจากนี้ บริษัทมีหน้าที่ปฏิบัติตามคำสั่งของหน่วยงานหรือเจ้าหน้าที่ผู้มีอำนาจตามกฎหมาย รวมถึงบริษัทอาจมีความจำเป็นที่จะต้องให้ความร่วมมือในการให้ข้อมูลแก่หน่วยงานที่เกี่ยวข้องในต่างประเทศ หากลูกค้าปฏิเสธไม่ให้ข้อมูลแก่บริษัท อาจทำให้บริษัทไม่สามารถจัดหาผลิตภัณฑ์และ/หรือให้บริการแก่ลูกค้าได้ " +
        "\n     เพื่อประโยชน์โดยชอบด้วยกฎหมายของบริษัท หรือของบุคคลหรือนิติบุคคลอื่น เช่น " +
        "\n          - มาตรการรักษาความปลอดภัย บริษัทมีการบันทึกเสียงทาง Call Center การบันทึกภาพ CCTV  ณ ทางเข้าออกบริษัท " +
        "\n          - การรักษาความสัมพันธ์กับลูกค้า เช่น การให้บริการลูกค้า การจัดการข้อร้องเรียน การประเมินความพึงพอใจ การดูแลลูกค้าโดยพนักงานของบริษัท การสื่อสารหรือนำเสนอผลิตภัณฑ์และ/หรือบริการต่าง ๆ ประเภทเดียวกันกับที่ลูกค้ามีอยู่กับบริษัทซึ่งเป็นประโยชน์กับลูกค้าเป็นระยะ ๆ " +
        "\n          - การบริหารความเสี่ยง การกำกับตรวจสอบ การบริหารจัดการภายในองค์กร รวมถึงการป้องกันการกระทำผิดกฎหมาย เช่น การทุจริต การคุกคามทางไซเบอร์ การฟอกเงิน และกฎหมายอื่น ๆ " +
        "\n          - การรักษาความปลอดภัยของข้อมูลส่วนบุคคล เช่น การทำให้ข้อมูลส่วนบุคคลเป็นข้อมูลที่ไม่สามารถระบุตัวบุคคลได้ (Anonymous Data) " +
        "\n          - วัตถุประสงค์ทางธุรกิจ บริษัทมีการเก็บรวบรวมข้อมูลส่วนบุคคลเพื่อประโยชน์ในการวิเคราะห์ข้อมูลทางสถิติหรือประชาสัมพันธ์บริษัท เช่น การบันทึกภาพ บันทึกเสียงในการจัดประชุม อบรม สันทนาการ หรือการออกบูธ " +
        "      * ในกรณีที่ลูกค้าปฏิเสธไม่ให้ข้อมูลแก่บริษัท อาจทำให้บริษัทไม่สามารถให้บริการลูกค้าได้อย่างมีประสิทธิภาพเท่าที่ควร " +
        "\n\n 3.แหล่งที่มาของข้อมูลส่วนบุคคล " +
        "\n\n     จากลูกค้าโดยตรง เช่น ข้อมูลที่ลูกค้ากรอกขณะลงทะเบียนสมัครใช้บริการ ข้อมูลที่ใช้ในการสมัครใช้บริการสมาชิก  ข้อมูลบัญชีผู้ใช้งาน (Account) หรือข้อมูลที่ลูกค้าได้แก้ไขปรับปรุงในข้อมูลบัญชีผู้ใช้งาน (Account) ของลูกค้า หรือข้อมูลที่ได้จากการที่ลูกค้าติดต่อกับบริษัทหรือทีมงานของบริษัท (เช่น ตัวแทน  หรือข้อมูลที่ได้จากบัญชีผู้ใช้งาน (Account) อื่น ๆ ข้อมูลจากการใช้ผลิตภัณฑ์ และ/หรือบริการของบริษัท  การติดต่อ เยี่ยมชม ค้นหา ผ่านเว็บไซต์ Call Center และช่องทางอื่น ๆ ของบริษัท  ตลอดจนข้อมูลในการร่วมกิจกรรมต่าง ๆ ทั้งในแพลตฟอร์ม, การทำสำรวจ, งานสัมมนาและ Road Show " +
        "\n\n 4.ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคล " +
        "\n\n     บริษัทจะเก็บรักษาข้อมูลส่วนบุคคลของลูกค้าไว้เป็นระยะเวลาเท่าที่จำเป็นเพื่อการดำเนินการตามวัตถุประสงค์ที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้ให้เสร็จสิ้น เว้นแต่กรณีที่กฎหมายกำหนดหรืออนุญาตให้เก็บรักษาข้อมูลไว้นานกว่า ซึ่งอาจมีกำหนดประมาณ 5 – 10 ปี หรือเกินกว่านั้นเท่าที่จำเป็น เช่น ตามอายุความที่กฎหมายกำหนดสำหรับเรื่องที่เกี่ยวข้อง เพื่อการดำเนินคดี หรือเพื่อการตรวจสอบของหน่วยงานที่กำกับดูแล " +
        "\n\n 5.การเปิดเผยข้อมูลส่วนบุคคล " +
        "\n\n     บริษัทจะไม่เปิดเผยข้อมูลส่วนบุคคลต่อบุคคลใดโดยไม่ได้รับความยินยอมจากลูกค้าก่อน อย่างไรก็ดี ลูกค้ารับทราบและยินยอมว่า เพื่อประสิทธิภาพในการให้บริการหรือเพื่อปฏิบัติตามกฎหมาย บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของลูกค้าให้กับบุคคลต่อไปนี้ " +
        "\n     หน่วยงานหรือเจ้าหน้าที่ของรัฐที่ใช้อำนาจหน้าที่ตามกฎหมาย" +
        "\n    โดยในการเปิดเผยข้อมูลส่วนบุคคลให้แก่บุคคลดังกล่าว บริษัทจะดำเนินการให้บุคคลเหล่านั้นเก็บรักษาข้อมูลส่วนบุคคลของผู้ใช้บริการไว้เป็นความลับ และไม่นำไปใช้เพื่อวัตถุประสงค์อื่นนอกเหนือจากขอบเขตที่บริษัทได้กำหนดไว้" +
        "\n\n 6.สิทธิของเจ้าของข้อมูลส่วนบุคคล" +
        "\n\n    การแก้ไข หรือลบข้อมูลส่วนบุคคล ลูกค้าสามารถแก้ไขหรือลบข้อมูลส่วนบุคคลของลูกค้าได้ตลอดเวลา ลูกค้าสามารถขอ “แบบคำขอเกี่ยวกับข้อมูลส่วนบุคคล” เพื่อกรอกข้อมูลและส่งให้กับองค์กร " +
        "\n    ในกรณีที่มีการร้องขอให้ลบข้อมูลส่วนบุคคลของผู้ใช้บริการจากระบบหรือฐานข้อมูลประชาชนนั้น องค์กรจะพยายามอย่างเต็มที่ตามความสามารถของระบบงานที่เกี่ยวข้องเพื่ออำนวยความสะดวกและดำเนินการตามคำร้องขอของผู้ใช้บริการ เว้นแต่จะปรากฏข้อเท็จจริงว่า การดำเนินการตามคำร้องขอนั้นจะเสี่ยงต่อการละเมิดนโยบายความเป็นส่วนตัวของผู้ใช้บริการรายอื่น หรือเป็นการขัดต่อกฎหมาย หรือมีความจำเป็นที่จะต้องเก็บข้อมูลไว้เพื่อเป็นพยานหลักฐานในการตรวจสอบหรือดำเนินคดีตามกฎหมาย หรือเพื่อปฏิบัติตามหน้าที่ตามกฎหมายที่ใช้บังคับ หรือเพื่อเป็นไปตามนโยบายความปลอดภัยของระบบ หรือกรณีที่เป็นการพ้นวิสัยในทางปฏิบัติตามคำร้องขอของผู้ใช้บริการ " +
        "\n    อย่างไรก็ดี แม้ว่าบริษัทจะได้ดำเนินการตามคำร้องขอของผู้ใช้บริการแล้ว ข้อมูลดังกล่าวอาจจะยังคงมีการบันทึกหรือทำสำเนาไว้ที่เซิร์ฟเวอร์ (Server) หรือระบบสำรอง (Backup System) ของบริษัท เพื่อเป็นการสำรองข้อมูลในกรณีที่เกิดความผิดพลาด บกพร่อง หรือเกิดจากความขัดข้องของระบบ " +
        "\n\n 7.การเพิกถอนความยินยอมของเจ้าของข้อมูลส่วนบุคคล จะไม่ส่งผลกระทบต่อการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล ที่เจ้าของข้อมูลส่วนบุคคลได้ให้ความยินยอมไปแล้วก่อนหน้านั้น" +
        "\n\n    ในกรณีที่เจ้าของข้อมูลส่วนบุคคลประสงค์ที่จะเพิกถอนความยินยอม ให้บริษัทเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล จะมีผลกระทบต่อผู้เพิกถอนการให้ความยินยอมเกี่ยวกับการพิจารณารับประกันภัย หรือการให้บริการลูกค้าหรือการให้บริการใดๆ ที่เกี่ยวข้องกับการประกันภัย และส่งผลให้บริษัทไม่สามารถปฏิบัติตามสัญญาประกันภัยได้ " +
        "";
  }
}
